<?php

if (! defined('LogicBoard_Install') )
{
	@include '../../logs/save_log.php';
	exit ( "Error, wrong way to file.<br><a href=\"/\">Go to main</a>." );
}

/****************************************/
// ИНФОРМАЦИЯ:
// ==== Форум: LogicBoard
// ==== Автор: Никита Курдин (ShapeShifter)
// ==== Copyright © Никита Курдин Игоревич 2011-2012
// ==== Данный код защищен авторскими правами
// ==== Официальный сайт: http://logicboard.ru

/****************************************/

$install_db = array();

if ($coding_forum == "cp1251")
    $coding_forum_conf = "windows-1251";
else
    $coding_forum_conf = "utf-8";
    
$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_groups";
$install_db[] = "CREATE TABLE ".$mysql_pref."_groups (
  `g_id` smallint(5) NOT NULL auto_increment,
  `g_title` varchar(40) NOT NULL default '',
  `g_prefix_st` varchar(250) NOT NULL default '',
  `g_prefix_end` varchar(250) NOT NULL default '',
  `g_icon` varchar(255) NOT NULL default '',
  `g_access_cc` tinyint(1) NOT NULL default '0',
  `g_supermoders` tinyint(1) NOT NULL default '0',
  `g_access` text NOT NULL,
  `g_show_online` tinyint(1) NOT NULL default '1',
  `g_new_topic` tinyint(1) NOT NULL default '1',
  `g_reply_topic` tinyint(1) NOT NULL default '1',
  `g_reply_close` tinyint(1) NOT NULL default '0',
  `g_warning` tinyint(1) NOT NULL default '0',
  `g_show_hiden` tinyint(1) NOT NULL default '0',
  `g_show_close_f` tinyint(1) NOT NULL default '0',
  `g_hide_text` tinyint(1) NOT NULL default '0',
  `g_signature` tinyint(1) NOT NULL default '1',
  `g_search` tinyint(1) NOT NULL default '1',
  `g_status` mediumint(8) NOT NULL default '50',
  `g_link_forum` tinyint(1) NOT NULL default '1',
  `g_tc_time` smallint(5) unsigned NOT NULL default '0',
  `g_pc_time` smallint(5) unsigned NOT NULL default '0',
  `g_show_ip` tinyint(1) NOT NULL default '0',
  `g_html_allowed` tinyint(1) NOT NULL default '0',
  `g_metatopic` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`g_id`),
  KEY `g_title` (`g_title`),
  KEY `g_supermoders` (`g_supermoders`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_dle_conf";
$install_db[] = "CREATE TABLE ".$mysql_pref."_dle_conf (
  `name` varchar(40) NOT NULL default '', 
  `c_val` text NOT NULL, 
  PRIMARY KEY  (`name`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_note";
$install_db[] = "CREATE TABLE ".$mysql_pref."_note (
  `id` mediumint(8) NOT NULL auto_increment,
  `name` varchar(40) NOT NULL default '',
  `text` text NOT NULL,
  `startdate` int(10) NOT NULL default '0',
  `lastdate` int(10) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `name` (`name`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_configuration";
$install_db[] = "CREATE TABLE ".$mysql_pref."_configuration (
  `conf_id` smallint(5) NOT NULL auto_increment,
  `conf_posi` smallint(5) NOT NULL DEFAULT '1',
  `conf_name` varchar(255) NOT NULL default '',
  `conf_desc` text NOT NULL,
  `conf_group` smallint(5) NOT NULL default '0',
  `conf_type` varchar(255) NOT NULL default '',
  `conf_key` varchar(255) NOT NULL default '',
  `conf_option` text NOT NULL,
  `conf_value` text NOT NULL,
  `conf_protect` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`conf_id`),
  UNIQUE KEY `conf_key` (`conf_key`),
  KEY `conf_name` (`conf_name`),
  KEY `conf_posi` (`conf_posi`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_configuration` (`conf_id`, `conf_posi`, `conf_name`, `conf_desc`, `conf_group`, `conf_type`, `conf_key`, `conf_option`, `conf_value`, `conf_protect`) VALUES
(1, 2, 'Сессия', 'Укажите время через которое будет сброшена сессия и потребуется повторная авторизация.', 2, '1', 'security_session', '1=1 час\r\n2=2 часа\r\n5=5 часов\r\n10=10 часов\r\n24=24 часа', '5', 1),
(2, 1, 'Адрес форума', 'Введите url адрес Вашего форума.<br />Обязательно наличие слеша в конце доменного имени.<br />Пример: http://logicboard.ru/forum/', 1, '3', 'general_site', '', '".$url_forum."', 1),
(3, 1, 'Прямые обращения к файлам', 'Сохранять данные пользователей, которые напрямую вызвали файл форума?', 4, '0', 'log_files', '', '1', 1),
(4, 2, 'E-Mail рассылка', 'Сохранять данные по рассылкам?', 4, '0', 'log_mail', '', '1', 1),
(5, 2, 'Название форума', 'Название форума будет использоваться в заголовке браузера, заголовке сообщений и страниц', 1, '3', 'general_name', '', '".$general_name."', 1),
(6, 3, 'Удалять логи авторизации', 'Удалять логи авторизации, которым больше месяца?', 4, '0', 'log_autoriz_del', '', '0', 1),
(8, 3, 'MySQL ошибки', 'Список IP адресов пользователей, кому разрешено видеть MySQL ошибки.<br />По одному IP на каждую строчку.', 2, '4', 'security_mysql', '', '".$_SERVER['REMOTE_ADDR']."', 1),
(9, 3, 'E-Mail администратора', 'Этот адрес будет использоваться в различных системных файлах для уведомления администратора об ошибках и др.', 1, '3', 'general_email', '', '".$email."', 1),
(10, 4, 'Время форума', 'Коррекция времени на форуме.\r\nВведите время в минутах, например: 25 или -30', 1, '3', 'general_time', '', '0', 1),
(16, 1, 'Метод отправки', 'Если в PHP недоступна функция mail(), то выберите SMTP метод.', 6, '1', 'mail_sendmetod', 'php=PHP mail ()\r\nSMTP=SMTP', 'php', 1),
(17, 2, 'Адрес почты', 'Данный адрес будет использоваться при отправки уведомлений с форума.', 6, '3', 'mail_email', '', '".$email."', 1),
(18, 3, 'SMTP хост', 'Адрес сервера. Обычно \"localhost\".', 6, '3', 'mail_smtphost', '', 'localhost', 1),
(19, 4, 'SMTP Порт', 'Порт сервера. Обычно \"25\".', 6, '3', 'mail_smtpport', '', '25', 1),
(20, 5, 'SMTP имя пользователя', 'В случае использования \"localhost\" обычно не требуется заполнять поле.', 6, '3', 'mail_smtpname', '', '', 1),
(21, 6, 'SMTP Пароль', 'В случае использования \"localhost\" обычно не требуется заполнять поле.', 6, '3', 'mail_smtppass', '', '', 1),
(22, 1, 'Время', 'Вывод списка онлайна за последние Х минут. Записи, которым больше Х минут будут удалены из базы. Введите количество минут.', 7, '3', 'online_time', '', '10', 1),
(65, 1, 'Включить обратную связь', '', 12, '0', 'feedback_on', '', '1', 1),
(66, 2, 'Разрешить использование гостям', 'Могут ли гости использовать обратную свзяь?', 12, '0', 'feedback_guest', '', '1', 1),
(27, 5, 'Включить gzip', 'Включить сжатие страниц. Это позволит экономить трафик.', 1, '0', 'general_gzip', '', '1', 1),
(29, 1, 'Длина заголовка (мин.)', 'Минимальное количество символов для заголовка темы.', 9, '3', 'topic_title_min', '', '5', 1),
(30, 2, 'Длина заголовка (макс.)', 'Максимальное количество символов для заголовка темы.', 9, '3', 'topic_title_max', '', '100', 1),
(31, 3, 'Горячая тема', 'Минимальное кол-во ответов в теме, чтобы присвоить ей статус \"Горячая\".', 9, '3', 'topic_hot', '', '20', 1),
(32, 4, 'Кол-во сообщений на странице', 'Максимальное количество сообщений выводимых на одной странице.', 10, '3', 'topic_post_page', '', '15', 1),
(33, 1, 'Длина сообщения (мин.)', 'Минимальная длина сообщения.', 10, '3', 'posts_text_min', '', '5', 1),
(34, 2, 'Длина сообщения (макс.)', 'Максимальная длина сообщения.', 10, '3', 'posts_text_max', '', '10000', 1),
(35, 3, 'Разбивка длинных слов', 'Максимальное количество символов в одном слове, если будет больше, то слово будет разделено.', 10, '3', 'posts_wordlen', '', '80', 1),
(37, 5, 'Кол-во тем на одной странице', 'Максимальное количество тем выводимых на одной странице.', 9, '3', 'topic_page', '', '15', 1),
(38, 6, 'Закрыть форум', 'Форум могут просматривать только те группы, которым разрешён просмотр закрытого форума.', 1, '0', 'general_close', '', '0', 1),
(39, 7, 'Сообщение закрытого форума', 'Сообщение будет выводиться пользователям, если форум был закрыт.', 1, '4', 'general_close_msg', '', 'Форум временно отключён.', 1),
(109, 2, 'Расширение файлов', 'Введите через запятую расширения файлов, которые можно загружать на фтп.<br />Внимание. В целях безопасности следующие расширения файлов запрещены:<br />phtml, php, php3, php4, php5, php6, phps, cgi, pl, asp, aspx, fpl, jsp.', 19, '3', 'upload_type', '', 'zip, rar, jpg, jpeg, gif, png, txt, pdf, doc', 1),
(40, 8, 'Мета описание', 'Описание форума, которое будет выводиться в метатеге \"description\".<br />Небольше 200 символов.', 1, '4', 'general_meta_desc', '', 'LogicBoard - By ShapeShifter.', 1),
(41, 9, 'Мета ключевые слова', 'Ключевые слова форума, которые будут выводиться в метатеге \"keywords\".<br />Каждое слово через запятую.<br />Небольше 1000 символов.', 1, '4', 'general_meta_key', '', 'Форум, Новый движок, LogicBoard', 1),
(42, 10, 'Смена шаблона', 'Разрешить пользователям менять шаблоны форума?', 1, '0', 'general_template', '', '0', 1),
(43, 0, 'Основной шаблон', 'Основной шаблон форума', 0, '0', 'template_name', '', 'Standart', 1),
(45, 10, 'Список вопросов', 'Выводится вместе/отдельно с капчей. Позволит улучшить защиту от ботов. <br />Желательно сделать большой список вопросов.<br />Оставьте поле пустым, чтобы не выводить дополнительные вопросы.<br />Каждый вариант с новой строки.<br />Вопрос=Ответ', 2, '4', 'security_captcha_dop', '', 'Какой сейчас год?=2012\r\n(10+40)*2=100', 1),
(46, 11, 'Выводить случайный вывод вопросов', 'Если нет - будет выводиться только первый вопрос в списке.', 2, '0', 'security_captcha_dop_v', '', '1', 1),
(47, 9, 'Выводить дополнительный вопрос в', 'Выберите, где будут выводиться дополнительные вопросы, если они есть (возможен выбор нескольких вариантов)', 2, '2', 'security_captcha_dop_out', 'guest=Ответы/Новые темы (для гостей)\r\nfeedback=Обратная связь', 'guest,feedback', 1),
(48, 6, 'Включить капчу при ответе/создании новой темы', 'Капча будет выводиться только у гостей.', 2, '0', 'security_captcha_posts', '', '1', 1),
(49, 12, 'Использовать почту как логин', 'Использование указанной почты при регистрации позволит существенно усложнить взломщику авторизоваться под чужим аккаунтом (т.к. почта не видна пользователям в отличии от их ников).', 2, '0', 'security_loginemail', '', '0', 1),
(154, 13, 'Выводить картинку из статьи', 'Выводить картинку из краткого описания в блоке, если она есть.<br />Выводится будет только первая картинка.', 15, '0', 'blockmod_dle_topnews_pic', '', '1', 1),
(153, 12, 'Количество статей в блоке', 'Укажите количество статей, которые будут выводится в блоке.', 15, '3', 'blockmod_dle_topnews_num', '', '7', 1),
(152, 11, 'Тип сортировки блока статей', 'Выберите тип сортировки блока новостей.', 15, '1', 'blockmod_dle_topnews_sort', '0=Новые\r\n1=ТОП за месяц по рейтингу\r\n2=ТОП за месяц по просмотрам\r\n3=ТОП за месяц по комментариям\r\n4=ТОП за всё время по рейтингу\r\n5=ТОП за всё время по просмотрам\r\n6=ТОП за всё время по комментариям\r\n7=Случайные новости', '0', 1),
(151, 10, 'Выводить блок статей', 'Вывод блока с статьями с сайта.<br />Тип сортировки блока устанавливается ниже.<br />Блок будет кешироваться (если не выбран тип сортировки: случайная статья).', 15, '0', 'blockmod_dle_topnews', '', '1', 1),
(59, 10, 'Ник бота', 'Данный ник будет указан при системных уведомлениях по ЛС. Например о новом ответе в подписанной теме.', 11, '3', 'pm_bot', '', 'Система', 1),
(60, 11, 'Шаблон ЛС уведомления о новом ответе', 'Шаблон будет использоваться при уведомлении пользоватля, подписанного на тему, по ЛС.<br />Используемые теги:<br />{link} - Ссылка на тему<br />{author} - Автор последнего ответа<br />{title} - Название темы', 11, '4', 'pm_subscribe', '', 'В теме <a href=\"{link}\">{title}</a> появился новый ответ.\r\nАвтор: {author}', 1),
(61, 6, 'Выводить последние темы', 'Выводить список последних тем в блоке?<br /><br />Это добавит 1 запрос к БД.', 15, '0', 'topic_lasttopics', '', '1', 1),
(62, 7, 'Количество последних тем', 'Введите количество последних тем, которое будет выводиться в блоке (если включена опция выше).', 15, '3', 'topic_lasttopics_num', '', '5', 1),
(63, 11, 'Удалять объявления по истечению срока', 'Если нет - объявления будет не активным (сохранено, но не будет выводиться на форуме).', 1, '0', 'general_del_fnotice', '', '0', 1),
(67, 3, 'На какой адрес отправлять письма', 'На указанный адрес будут отправляться все письма.', 12, '3', 'feedback_email', '', '".$email."', 1),
(68, 4, 'Выводить список администраторов', 'Если включена эта опция, то в обратной связи будет выводиться список пользователей из данной группы. На указанный в их профиле почтовый адрес будут отправляться сообщения.<br />Опция \"На какой адрес отправлять письма\" будет отключена.', 12, '0', 'feedback_admins', '', '1', 1),
(69, 8, 'Выводить капчу в обратной связи', 'Капча будет выводиться только у гостей, если им разрешено пользоваться обратной связью.', 2, '0', 'security_captcha_feedback', '', '1', 1),
(70, 13, 'Количество попыток авторизаций', 'Введите количество попыток авторизаций на сайте, через которое пользователь будет временно заблокирован.<br />Оставьте поле пустым или введите 0, чтобы снять ограничение.', 2, '3', 'security_logincount', '', '5', 1),
(71, 14, 'Количество минут блокировки', 'Введите количество минут, которые пользователь будет ждать, чтобы попробовать снова авторизоваться.<br />Введите 0 или оставьте поле пустым, чтобы отключить блокировку.', 2, '3', 'security_loginmin', '', '10', 1),
(72, 8, 'Проверять логи голосования', 'Проверка логов позволит выводить результат голосования пользователю, который уже голосовал в данной теме.<br />Если проверки не будет, то ему будет выводиться псевдо голосование и при попытке проголосвать появиться сообщение, что он уже учавствовал в этом голосовании.<br />Опция делает +1 запрос к БД.', 9, '0', 'topic_polllog', '', '1', 1),
(73, 12, 'Минимальное кол-во символов для поиска', 'Введите минимальное количество символом для ключевого слова в поиске.<br />Чем меньше слово - тем больше нагрузка на БД.', 1, '3', 'general_searchword', '', '3', 1),
(74, 2, 'Количество пользователей на одной странице', 'Количество пользователей, которые будут выводиться на одной странице.', 7, '3', 'member_page', '', '15', 1),
(75, 1, 'Включить защиту от парсинга', 'Данная опция создаёт нагрузку на Ваш сервер.<br />Настраиваете опцию аккуратно, т.к. вы можете заблокировать поискового бота.<br />Если у вас имеются проблемы с ресурсами, то можете отключить эту опцию.', 13, '0', 'antiflood_parse', '', '0', 1),
(76, 2, 'Количество обращений за Х секунд', 'Количество обращений к форуму за Х секунд после чего будет задействована блокировка пользователя на Х секунд.', 13, '3', 'antiflood_loadpage', '', '20', 1),
(77, 3, 'Интервал (секунды)', 'Время за которое пользователь может совершить Х обращений.', 13, '3', 'antiflood_load_interval', '', '1', 1),
(78, 4, 'Количество отправки данных за Х секунд', 'Количество отправки данны с форм (новое личное сообщение, новый ответ, новая темы, поиск и т.п.) за Х секунд после чего будет задействована блокировка пользователя на Х секунд.', 13, '3', 'antiflood_buttom', '', '3', 1),
(79, 5, 'Интервал (секунды)', 'Время за которое пользователь может совершить Х отправок форм.', 13, '3', 'antiflood_interval', '', '7', 1),
(80, 6, 'Время блокировки (секунды)', 'Укажите на какое время пользователь будет заблокирован.<br />Время в секундах.', 13, '3', 'antiflood_blocktime', '', '15', 1),
(90, 8, 'Выводить личные статусы', 'Выводить последние Х личных статусов в блоке?<br /><br />Это добавит 1 запрос к БД.', 15, '0', 'blockmod_status', '', '1', 1),
(91, 9, 'Количество статусов', 'Введите количество последних личных статусов, которое будет выводиться в блоке (если включена опция выше).', 15, '3', 'blockmod_statusnum', '', '5', 1),
(150, 4, 'Тип ЧПУ', 'Тип 1 - ссылки на полную новость будут иметь вид http://site.ru/id-имя новости.html<br /><br />Тип 2 - ссылки на полную новость будут иметь вид http://site.ru/категория/подкатегория/id-имя новости.html<br /><br />Тип 3 - ссылки на полную новость будут иметь вид http://site.ru/2008/04/02/имя новости.html, внимание данный тип несет повышенную', 3, '1', 'dle_seo_type', '1=Тип 1\r\n2=Тип 2\r\n0=Тип 3', '2', 1),
(149, 3, 'Включить ЧПУ', 'Eсли \"Да\", то ссылки на сайт будут форсироваться в виде псевдо URL, которые улучшают визуальное восприятие ссылки.<br />Например http://site.ru/имя страницы.html', 3, '0', 'dle_allow_alt_url', '', '1', 1),
(148, 2, 'Файл админпанели', 'Укажите название файла админпанели CMS DLE.<br />По умолчанию это admin.php, если в настройках CMS DLE Вы изменили название - обязательно введите новое название здесь.', 3, '3', 'general_site_admindle', '', '".$url_adminsite."', 1),
(98, 1, 'Включить RSS экспорт', 'Если RSS экспорт отключен, то не забудьте убрать из шаблона форума ссылку на RSS ленту.', 17, '0', 'rss_on', '', '1', 1),
(99, 2, 'Кол-во тем выводить', 'Введите количество тем для вывода в RSS ленте.', 17, '3', 'rss_topics', '', '15', 1),
(100, 3, 'Кол-во сообщений выводить', 'Введите количество сообщений для вывода в RSS ленте.', 17, '3', 'rss_posts', '', '15', 1),
(101, 1, 'Включить корзину', 'При удалении сообщений и тем они будут перемещены в корзину и только из неё можно будет удалить данные из БД.', 18, '0', 'basket_on', '', '0', 1),
(102, 2, 'Какой форум использовать в качестве корзины', 'Введите ID форума (НЕ категории), который будет использоваться в качестве корзины.<br />Если Вы ничего не введёте или введете не существующий форум - корзина не будет работать.<br /><br />Настройки видимости корзины беруться из настроект форума. В корзине запрещено создание тем и сообщений.<br /><br />При удалении тем или сообщений из корзины - будут уменьшаться счётчики у пользователей.', 18, '3', 'basket_fid', '', '0', 1),
(106, 15, 'Скрыть IP администрации', 'Модераторы и выше могут видеть IP всех пользователей. Данная опция позволяет скрыть у администраторов их IP.', 2, '0', 'security_adminip', '', '1', 1),
(103, 6, 'Склеивать сообщения', 'Склеивать сообщения, если пользователь добавил подряд 2 и более сообщений (при условии, что интервал между ними не менее X минут)?', 10, '0', 'posts_paste', '', '0', 1),
(104, 7, 'Максимальный интервал для склеивания сообщений', 'Введите количество минут, по истечению которых добавленные подряд сообщения от одного автора не будут склеиваться.', 10, '3', 'posts_pastemin', '', '5', 1),
(105, 4, 'Максимальная ширина картинки', 'Введите максимальную ширину картинки, если ширина превысит указанный лимит - она будет автоматически уменьшена.<br />Оставьте поле пустым или введите 0, чтобы отключить уменьшение.', 8, '3', 'pic_autosize', '', '350', 1),
(107, 9, 'Включить сервис публикации ссылок', 'Если да - на странице темы будут выводиться сервисы для публикации ссылок. Список таких сервисов Вы можете отредактировать в Форум -> Сервисы публикации.', 9, '0', 'topic_sharelink', '', '1', 1),
(108, 13, 'Группа забаненых', 'Введите название группы, которое будет выводиться в поле группы, если пользователь забанен.', 1, '3', 'general_bangroup', '', 'Забаненые', 1),
(110, 3, 'Максимальный размер файла', 'Введите максимальный размер файла для загрузки в килобайтах.', 19, '3', 'upload_maxsize', '', '30720', 1),
(111, 1, 'Разрешить загрузку файлов', 'Если Вы запретите загрузку файлов и при этом в форумах будет разрешена загрузка - пользователь не сможет ничего загрузить.', 19, '0', 'upload_global', '', '1', 1),
(112, 4, 'Максимальное кол-во одновременных загрузок', 'Введите максимальное количество файлов, которые пользователь может загружать одновременно.<br />Для снятия ограничения введите 0.', 19, '3', 'upload_num', '', '5', 1),
(113, 5, 'Максимальная скорость скачивания', 'Введите максимальную скорость скачивания файла (кб/с).<br />Для снятия ограничения введите 0.', 19, '3', 'upload_speed', '', '400', 1),
(114, 6, 'Включить счётчик скачиваний', 'Включение счётчика не много увеличивает нагрузку на сервер - 1 дополнительный запрос к БД.<br /><b>Псевдо скачивание</b> - счётчик обновляется сразу как только пользователь начал скачивать файл, даже если файл не был скачан целиком.<br /><b>Реальное скачивание</b> - счётчик обновляется только после скачивания всего файла. Если же файл не был скачан целиком - счётчик не обновляется.', 19, '1', 'upload_count', '0=Нет\r\n1=Да, псевдо скачивание\r\n2=Да, реальное скачивание', '1', 1),
(115, 7, 'Разрешить скачивать файлы', 'Вы можете запретить глобально всем скачивать уже загруженные файлы.', 19, '0', 'upload_download', '', '1', 1),
(116, 8, 'Блокировать скачивание файлов с других серверов', 'Если ссылка на скачивание файла была нажата на другом сайте (домене), а так же ICQ, E-Mail и т.п. - загрузка будет заблокирована.', 19, '0', 'upload_antileech', '', '1', 1),
(117, 9, 'Включить поддержку докачивания файлов', 'Если произойдёт разрыв соединения, то пользователь сможет позже докачать файл.', 19, '0', 'upload_force', '', '1', 1),
(118, 10, 'Использовать первоначальное имя файла', 'Во время скачивания у файла будет имя такое же как во время загрузки. Иначе имя файла будет такое же какое оно на сервере.', 19, '0', 'upload_realname', '', '1', 1),
(119, 1, 'Включить предупреждения', 'Если опция отключена, то никто не сможет получить новые предупреждения, так же история предупреждений будет недоступна.<br />Внимание! Предупреждения можно давать только группе или пользователю, который не имеет прав модератора или выше.', 20, '0', 'warning_on', '', '1', 1),
(120, 2, 'Максимальный уровень', 'Введите максимальный уровень предупреждения по достижению которого пользователь будет заблокирован.', 20, '3', 'warning_levels', '', '5', 1),
(121, 3, 'Количество дней блокировки', 'Введите кол-во дней, которые пользователь будет заблокирован.<br />Введите 0 или оставьте поле пустым - блокировка навсегда.', 20, '3', 'warning_days', '', '7', 1),
(147, 1, 'Адрес сайта на CMS DLE', 'Введите url адрес Вашего сайта на CMS DLE.<br />Обязательно наличие слеша в конце доменного имени.<br />Пример: http://logicboard.ru/', 3, '3', 'general_site_dle', '', '".$url_site."', 1),
(123, 5, 'Разершить просмотр истории', 'Если разрешён просмотр истории предупреждений - все пользвоатели смогут её увидеть, иначе историю могут просмотреть только группы имеющие право предупреждать.', 20, '0', 'warning_show', '', '1', 1),
(124, 6, 'Уведомлять пользователя по ЛС', 'Уведомлять пользователя, если ему было добавлено/удалено предупреждение?', 20, '0', 'warning_lcchange', '', '1', 1),
(125, 7, 'Текст блокировки', 'Введите текст, который будет указан в виде причины блокировки пользователя.', 20, '4', 'warning_text', '', 'Максимальный уровень предупреждения превышен.', 1),
(126, 1, 'Количество символов в названии последней темы', 'Введите максимальное количество символов для названия последней темы.<br />Если название темы будет больше указанного количества символов - оно будет сокращено.<br />Введите 0, чтобы стнять ограничение.', 21, '3', 'forums_topic_title', '', '15', 1),
(127, 2, 'Выводить модераторов у форумов', 'Выводить список модераторов у каждого форума?', 21, '0', 'forums_moder_list', '', '0', 1),
(128, 3, 'Количество подфорумов на одной строке', 'Введите количество подфорумов, которые будут выводится на одной строке.', 21, '3', 'forums_subforums', '', '4', 1),
(129, 4, 'Выводить блок последних новостей', 'Выводить блок последних новостей, который выводит ссылку на тему из указанного форума.', 21, '0', 'forums_news', '', '1', 1),
(130, 15, 'Введите ID новостного форума', 'Введите ID форума, который будет считаться новостным и из него будет экспортироваться последняя тема в блок последних новостей.', 21, '3', 'forums_news_fid', '', '2', 1),
(132, 8, 'AJAX загрузка ответов', 'Функция позволяет без обновления страницы подгружать ответы с других страниц темы по мере необходимости (когда пользователь доходит до последнего ответа - загружаются новые, если они есть).<br />Помимо удобства для пользователя функция экономит ресурсы сервера.<br />Пользователь может отключить для себя эту функцию вручную.', 10, '0', 'posts_get_next_page', '', '0', 1),
(134, 10, 'Автоматическая проверка ответа', 'Вы можете указать интервал автоматической проверки новых ответов в теме в секундах.<br />Оставьте поле пустым или введите 0, чтобы отключить автоматическую проверку.<br />Рекомендуемое количество секунд не менее 4.<br />Максимально количество скеунд равно 1200 (20 мин.)', 10, '3', 'posts_check_new_auto', '', '0', 1),
(135, 3, 'Включить онлайн модуль?', 'Модуль онлайна учитывает всех посетителей Вашего форума, но для этого требуется много ресурсов, если у Вас часто возникает высокая нагрузка на сервер, то Вы можете отключить данный модуль и сэкономить ресурсы.', 7, '0', 'online_status', '', '1', 1),
(136, 1, 'Предупреждать о переходе', 'При переходе по внешней ссылки пользователь сначала увидет страницу с предупреждением, после чего он сможет перейти по ссылке или вернуться назад на форум.', 22, '0', 'link_warning', '', '1', 1),
(137, 2, 'Текст предупреждения', 'Введите Ваш текст предупреждения о переходе по внешней ссылке.<br />{link} - Адрес внейшней ссылки<br />{title} - Название форума<br />{back_link} - Ссылка для возврата на ту страницу, с которой пользователь перешёл<br />{main_link} - Ссылка на главную страницу форума', 22, '4', 'link_warning_text', '', '<b>Внимание!</b> Вы переходите по внешней ссылке <b>{link}</b>\r\n\r\nАдминистрация форума не несёт ответственности за содержимое сайта.\r\n\r\nТакже Вы можете вернуться обратно: {back_link}', 1),
(138, 3, 'Количество секунд перед редиректом', 'Введите количество секунд, через которое пользователь будет автоматически перенаправлен по внешней ссылке.<br />Оставьте поле пустым или введите 0, чтобы отключить авто редирект.', 22, '3', 'link_redirect', '', '2', 1),
(139, 4, 'Белый список', 'Если Вы хотите, чтобы некоторые внешние ссылки (сайты) не зашифровывались форумом, то введите адреса таких сайтов (каждый на новой строке).<br />Примеры:<br />yandex.ru<br />logicboard.ru', 22, '4', 'link_white_list', '', '', 1),
(140, 6, 'Изменение сообщений в темах', 'Сохранять логи действий с сообщениями?', 4, '0', 'log_posts', '', '1', 1),
(141, 5, 'Изменение тем', 'Сохранять логи действий с темами?', 4, '0', 'log_topics', '', '1', 1),
(142, 7, 'Сохранять подробную информацию о темах и сообщениях', 'Сохранять подробную информацию об изменённых темах и сообщениях?<br />В логах будет видно что на что было изменено, но это может значительно увеличить размер базы данных.', 4, '0', 'log_pt_info', '', '1', 1),
(143, 14, 'Включить сжатие файлов', 'Включить сжатие JS и CSS файлов?<br />Это существенно уменьшит размеры файлов, а также в разы снизить количество HTTP запросов, что существенно ускоряет время загрузки страниц.', 1, '0', 'general_minify', '', '1', 1),
(144, 15, 'Выводить подробную информацию о странице', 'В конце исходного кода страницы будет выводиться подробная информация о работе скрипта и результате сжатия страницы (кол-во MySQL запросов, размер страницы, размер файлов кеша и др.).', 1, '0', 'general_gzipout', '', '1', 1),
(145, 16, 'MySQL ошибки (доступ по паролю)', 'Данная опция нужна, если Вы указали список IP адресов, которым разрешён просмотр подробностей MySQL ошибок, но по каким-то причинам у Вас изменился IP адрес и Вы не можете увидеть появившуюся ошибку или Вам нужно предоставить доступ к этой информации другому человеку.<br />Добавьте в адресную строку код: &sql_error=ПАРОЛЬ', 2, '3', 'security_mysqlpass', '', 'password', 1),
(146, 0, 'Основной язык', 'Основной язык форума', 0, '0', 'language_name', '', 'Russian', 1),
(155, 16, 'Кодировка форума', 'Выберите кодировку форума.<br /><b>Внимание!</b> <a href=\"http://logicboard.ru/support/cat-faq/topic-196.html\" target=\"_blank\">Подробная инструкция</a> на официальном сайте.', 1, '1', 'general_coding', 'windows-1251=windows-1251\r\nutf-8=UTF-8', '{$coding_forum_conf}', 1),
(157, 17, 'Включить ЧПУ', 'Веб-адреса, удобные для восприятия человеком.<br />Пример: http://site.ru/forum/category/topic-1.html', 1, '0', 'general_rewrite_url', '', '".$general_rewrite_url."', 1),
(158, 11, 'Разершить гостям голосовать за полезность сообщения', 'У каждого сообщения есть счётчик полезности, на основе этого счётчика можно определить какие сообщения являются полезными, а какие безполезными или флудом.', 10, '0', 'posts_utility', '', '0', 1),
(159, 1, 'Уведомлять администрацию', 'Уведомлять администраторов по ЛС о новой жалобе?<br />Модераторы форума, в котором была жалоба, автоматически будут уведомлены по ЛС о ней.<br />Если у форума нет модераторов - будут уведомлены супер-модераторы, если их тоже нет - будет уведомлена администрация.', 23, '0', 'complaint_admins', '', '0', 1),
(160, 2, 'Уведомлять супер-модераторов', 'Уведомлять супер-модераторов по ЛС о новой жалобе?<br />Модераторы форума, в котором была жалоба, автоматически будут уведомлены по ЛС о ней.<br />Если у форума нет модераторов - будут уведомлены супер-модераторы, если их тоже нет - будет уведомлена администрация.', 23, '0', 'complaint_moders', '', '0', 1),
(168, 3, 'Максимальный размер картинки', 'Введите максимальный размер картинки для загрузки в килобайтах.<br />Для снятия ограничения введите 0.', 19, '3', 'upload_maxsize_pic', '', '1024', 1),
(167, 5, 'Изменять размер картинки с помощью PHP', 'Все картинки будут уменьшаться пропорционально с помощью php.<br />Возможно увеличение времени обработки сообщений.', 8, '0', 'pic_smallphp', '', '1', 1),
(166, 5, 'Кол-во онлайн пользователей в блоке статистики', 'Введите количество онлайн пользователей, которые будут выводиться в блоке статистики.<br />Введите 0, чтобы убрать лимит.', 7, '3', 'online_limitblock', '', '100', 1),
(165, 4, 'Количество статусов на одной странице', 'Количество статусов пользователей, которые будут выводиться на одной странице.', 7, '3', 'status_page', '', '17', 1),
(164, 16, 'Объединить счётчик ответов и новых тем', 'Если нет - каждая новая тема не будет прибавлять +1 к счётчику сообщений/ответов.', 21, '0', 'forums_unitetp', '', '0', 1),
(163, 10, 'Выводить все форумы, где распологается тема', 'Опция относится к списку последних тем, активных тем, всех тем пользователя, избарнных тем и тем, на которые подписался пользователь, также список последних сообщений, всех сообщений пользователей.<br /><br />Будет выводится не только форум, в котором находится тема или сообщение, но все родительские форумы.', 9, '0', 'topic_allforums', '', '1', 1),
(162, 7, 'Разрешить авторизацию с помощью uLogin', 'Разрешить пользователям авторизовываться и регистрироваться через сервис uLogin?<br />Если данная опция будет отключена - не забудьте убрать код от uLogin из файла шаблона login.tpl', 5, '0', 'regist_ulogin', '', '1', 1)";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_configuration_group";
$install_db[] = "CREATE TABLE ".$mysql_pref."_configuration_group (
  `conf_gr_id` smallint(5) NOT NULL auto_increment,
  `conf_gr_name` varchar(255) NOT NULL default '',
  `conf_gr_prefix` varchar(255) NOT NULL default '',
  `conf_gr_desc` text NOT NULL,
  `conf_gr_group` varchar(255) NOT NULL default '',
  `conf_gr_group_title` varchar(255) NOT NULL default '',
  PRIMARY KEY  (`conf_gr_id`),
  KEY `conf_gr_name` (`conf_gr_name`),
  KEY `conf_gr_group` (`conf_gr_group`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_configuration_group` (`conf_gr_id`, `conf_gr_name`, `conf_gr_prefix`, `conf_gr_desc`, `conf_gr_group`, `conf_gr_group_title`) VALUES
(1, 'Основные настройки', 'general_', 'Здесь находятся базовые настройки форума', 'general', 'Основные'),
(2, 'Безопасность', 'security_', 'Настройки безопасности форума', 'security', 'Безопасность'),
(4, 'Журнал логов', 'log_', 'Запись всех действияй в центре управления', 'security', 'Безопасность'),
(6, 'Почта', 'mail_', 'Настройки почты форума. Уведомления пользователей, рассылка и другое.', 'general', 'Основные'),
(7, 'Списки: онлайн, пользователи, статусы', 'online_', 'Настройки вывода списков: онлайн пользователи, все пользователи и статусы пользователей.', 'member', 'Пользователи'),
(8, 'Изображения', 'pic_', 'Настройки изображений (картинок)', 'general', 'Основные'),
(9, 'Настройка тем', 'topic_', 'Настройка вывода, добавление и т.п.', 'topic_posts', 'Темы и сообщения'),
(10, 'Сообщения', 'posts_', 'Настройки сообщений на форуме', 'topic_posts', 'Темы и сообщения'),
(11, 'Личные сообщения', 'pm_', 'Настройка личных сообщений', 'member', 'Пользователи'),
(12, 'Обратная связь', 'feedback_', 'Настройки обратной связи', 'general', 'Основные'),
(13, 'Антифлуд', 'antiflood_', 'Настройки антифлуд защиты и парсинга', 'security', 'Безопасность'),
(15, 'Модули вывода в блоках', 'blockmod_', 'Настройка модулей, которые выводят инфорамцию на всех страницах форума (последние темы, статусы и т.п.)', 'blocks', 'Блоки'),
(17, 'RSS', 'rss_', 'Управление RSS лентой', 'general', 'Основные'),
(18, 'Корзина', 'basket_', 'Настройка корзины', 'general', 'Основные'),
(19, 'Загрузка файлов', 'upload_', 'Настройки загрузок файлов', 'general', 'Основные'),
(20, 'Предупреждения', 'warning_', 'Настройки предупреждений пользователей', 'member', 'Пользователи'),
(21, 'Форумы', 'forums_', 'Настройка форумов.', 'general', 'Основные'),
(22, 'Внешние ссылки в сообщениях', 'link_', 'Настройки работы с внешними ссылками', 'security', 'Безопасность'),
(3, 'Настройки CMS DLE', 'dle_', 'Здесь находятся базовые настройки сайта на CMS DLE', 'general', 'Основные'),
(23, 'Система жалоб', 'complaint_', 'Настройки функции системы жалоб', 'general', 'Основные');";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_session_cc";
$install_db[] = "CREATE TABLE ".$mysql_pref."_session_cc (
  `member_id_online` mediumint(8) NOT NULL default '0',
  `lastdate_online` int(10) NOT NULL default '0',
  `ip_online`  varchar(16) default NULL,
  `location_online` varchar(255) NOT NULL,
  PRIMARY KEY  (`member_id_online`),
  KEY `lastdate_online` (`lastdate_online`),
  KEY `ip_online` (`ip_online`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_logs_login_cc";
$install_db[] = "CREATE TABLE ".$mysql_pref."_logs_login_cc (
  `id` mediumint(8) NOT NULL auto_increment,
  `member_name` varchar(40) NOT NULL default '',
  `date` int(10) NOT NULL default '0',
  `ip`  varchar(16) default NULL,
  `login` tinyint(1) NOT NULL default '0',
  `info` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `member_name` (`member_name`),
  KEY `date` (`date`),
  KEY `login` (`login`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_logs_actions_cc";
$install_db[] = "CREATE TABLE ".$mysql_pref."_logs_actions_cc (
  `id` mediumint(8) NOT NULL auto_increment,
  `member_name` varchar(40) NOT NULL default '',
  `date` int(10) NOT NULL default '0',
  `ip`  varchar(16) default NULL,
  `module` varchar(255) NOT NULL default '',
  `op` varchar(255) NOT NULL default '',
  `info` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `member_name` (`member_name`),
  KEY `date` (`date`),
  KEY `module` (`module`),
  KEY `op` (`op`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_logs_topics";
$install_db[] = "CREATE TABLE ".$mysql_pref."_logs_topics (
  `id` int(10) NOT NULL auto_increment,
  `fid` smallint(5) NOT NULL default '0',
  `tid` int(10) NOT NULL default '0',
  `mid` mediumint(8) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  `ip`  varchar(16) default NULL,
  `act_st` tinyint(2) NOT NULL default '0',
  `info` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `fid` (`fid`),
  KEY `tid` (`tid`),
  KEY `mid` (`mid`),
  KEY `date` (`date`),
  KEY `act_st` (`act_st`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_logs_posts";
$install_db[] = "CREATE TABLE ".$mysql_pref."_logs_posts (
  `id` int(10) NOT NULL auto_increment,
  `fid` smallint(5) NOT NULL default '0',
  `tid` int(10) NOT NULL default '0',
  `pid` int(10) NOT NULL default '0',
  `mid` mediumint(8) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  `ip`  varchar(16) default NULL,
  `act_st` tinyint(2) NOT NULL default '0',
  `info` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `fid` (`fid`),
  KEY `tid` (`tid`),
  KEY `pid` (`pid`),
  KEY `mid` (`mid`),
  KEY `date` (`date`),
  KEY `act_st` (`act_st`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_members_ranks";
$install_db[] = "CREATE TABLE ".$mysql_pref."_members_ranks (
  `id` mediumint(8) NOT NULL auto_increment,
  `title` varchar(255) NOT NULL default '',
  `post_num` int(10) NOT NULL default '0',
  `stars` varchar(255) NOT NULL default '',
  `mid` mediumint(8) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `title` (`title`),
  KEY `post_num` (`post_num`),
  KEY `stars` (`stars`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_members_ranks` (`id`, `title`, `post_num`, `stars`) VALUES
(1, 'Новичок', 0, '1'),
(2, 'Участник', 20, '2'),
(3, 'Активный участник', 50, '3')";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_forums";
$install_db[] = "CREATE TABLE ".$mysql_pref."_forums (
`id` smallint(5) NOT NULL auto_increment,
`ficon` varchar(255) NOT NULL default '',
`parent_id` smallint(5) NOT NULL DEFAULT '0',
`posi` smallint(5) NOT NULL DEFAULT '1',
`title` varchar(255) NOT NULL default '',
`description` text NOT NULL,
`alt_name` varchar(200) NOT NULL default '',
`last_post_member` varchar(255) NOT NULL default '',
`last_post_member_id` mediumint(8) NOT NULL default '0',
`last_post_date` int(10) NOT NULL default '0',
`last_post_id` int(10) default NULL default '0',
`last_title` varchar(255) NOT NULL default '',
`last_topic_id` int(10) NOT NULL default '0',
`postcount` tinyint(1) NOT NULL default '1',
`allow_bbcode` tinyint(1) NOT NULL default '1',
`allow_bbcode_list` varchar(100) NOT NULL default '',
`allow_poll` tinyint(1) NOT NULL default '1',
`posts` mediumint(8) NOT NULL default '0',
`topics` mediumint(8) NOT NULL default '0',
`posts_hiden` mediumint(7) NOT NULL default '0',
`topics_hiden` mediumint(7) NOT NULL default '0',
`password` varchar(40) NOT NULL default '',
`password_notuse` varchar(255) NOT NULL default '',
`group_permission` text NOT NULL,
`sort_order` varchar(40) NOT NULL default '',
`rules` text NOT NULL,
`meta_desc` text NOT NULL,
`meta_key` text NOT NULL,
`flink` varchar(255) NOT NULL default '',
`flink_npage` tinyint(1) NOT NULL default '0',
PRIMARY KEY  (`id`),
KEY `parent_id` (`parent_id`),
KEY `posi` (`posi`),
KEY `alt_name` (`alt_name`),
KEY `last_post_member` (`last_post_member`),
KEY `last_post_member_id` (`last_post_member_id`),
KEY `last_post_date` (`last_post_date`),
KEY `last_post_id` (`last_post_id`),
KEY `last_topic_id` (`last_topic_id`),
KEY `lposts` (`posts`),
KEY `topics` (`topics`),
KEY `sort_order` (`sort_order`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_forums` (`id`, `parent_id`, `posi`, `title`, `description`, `alt_name`, `last_post_member`, `last_post_member_id`, `last_post_date`, `last_post_id`, `last_title`, `last_topic_id`, `postcount`, `allow_bbcode`, `allow_poll`, `posts`, `topics`, `posts_hiden`, `topics_hiden`, `password`, `password_notuse`, `group_permission`, `sort_order`, `rules`, `meta_desc`, `meta_key`) VALUES
(1, 0, 1, 'Категория', '', 'firstcat', '', 0, 0, 0, '', 0, 1, 1, 1, 0, 0, 0, 0, '', '', '0', '', '', '', ''),
(2, 1, 1, 'Тестовый форум', '', 'test', 'LogicBoard', 0, 1294685988, 0, 'Добро пожаловать', 1, 1, 1, 1, 0, 1, 0, 0, '', '', 'a:6:{i:1;a:6:{s:10:\"read_forum\";i:1;s:10:\"read_theme\";i:1;s:11:\"creat_theme\";i:1;s:12:\"answer_theme\";i:1;s:12:\"upload_files\";i:0;s:14:\"download_files\";i:0;}i:2;a:6:{s:10:\"read_forum\";i:1;s:10:\"read_theme\";i:1;s:11:\"creat_theme\";i:1;s:12:\"answer_theme\";i:1;s:12:\"upload_files\";i:0;s:14:\"download_files\";i:0;}i:3;a:6:{s:10:\"read_forum\";i:1;s:10:\"read_theme\";i:1;s:11:\"creat_theme\";i:1;s:12:\"answer_theme\";i:1;s:12:\"upload_files\";i:0;s:14:\"download_files\";i:0;}i:4;a:6:{s:10:\"read_forum\";i:1;s:10:\"read_theme\";i:1;s:11:\"creat_theme\";i:1;s:12:\"answer_theme\";i:1;s:12:\"upload_files\";i:0;s:14:\"download_files\";i:0;}i:5;a:6:{s:10:\"read_forum\";i:1;s:10:\"read_theme\";i:1;s:11:\"creat_theme\";i:0;s:12:\"answer_theme\";i:0;s:12:\"upload_files\";i:0;s:14:\"download_files\";i:0;}i:6;a:6:{s:10:\"read_forum\";i:1;s:10:\"read_theme\";i:1;s:11:\"creat_theme\";i:0;s:12:\"answer_theme\";i:0;s:12:\"upload_files\";i:0;s:14:\"download_files\";i:0;}}', 'DESC', '', '', '')";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_staticpage";
$install_db[] = "CREATE TABLE ".$mysql_pref."_staticpage (
  `id` mediumint(8) NOT NULL auto_increment,
  `title` varchar(100) NOT NULL default '',
  `name` varchar(255) NOT NULL default '',
  `description` text NOT NULL,
  `date` int(10) NOT NULL default '0',
  `metadescr` varchar(200) NOT NULL default '',
  `metakeys` text NOT NULL,
  `views` mediumint(8) NOT NULL default '0',
  `html_br` tinyint(1) NOT NULL default '1',
  PRIMARY KEY  (`id`),
  KEY `title` (`title`),
  KEY `views` (`views`),
  KEY `date` (`date`),
  KEY `name` (`name`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_templates_email";
$install_db[] = "CREATE TABLE ".$mysql_pref."_templates_email (
  `id` mediumint(8) NOT NULL auto_increment,
  `title` varchar(255) NOT NULL default '',
  `body_text` text NOT NULL,
  `date` int(10) NOT NULL default '0',
  `protect` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `title` (`title`),
  KEY `protect` (`protect`),
  KEY `date` (`date`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_templates_email` (`id`, `title`, `body_text`, `date`, `protect`) VALUES
(3, 'Уведомления о новом ответе в теме', 'Здравствуйте, <b>{user_name}</b>.<br /><br />Уведомляем вас о новых ответах в теме.<br />{message}<br /><br />=============================<br /><br />Если вы не запрашивали эту информацию, то просто проигнорируйте данное сообщение, в случаи повторения данной ситации просьба обратиться к администрации форума для устранения ошибки.<br /><br />С уважением,<br />Администрация {forum_name}.', ".$time.", 1),
(2, 'Уведомление о новом ЛС', 'Здравствуйте, <b>{user_name}</b>.<br /><br />Уведомляем вас о новом личном сообщении<br /><br />=============================<br /><br />{message}<br /><br />{active_link}<br /><br />=============================<br /><br />С уважением,<br />Администрация {forum_name}.', ".$time.", 1),
(1, 'Обратная связь', 'Здравствуйте, <b>{user_name}</b>.<br /><br />Данное письмо отправлено с <a href=\"{froum_link}\">{forum_name}</a>.<br /><br />=============================<br /><br />{message}<br /><br />IP адрес отправителя: {user_ip}<br /><br />=============================<br /><br />С уважением,<br />Администрация {forum_name}.', ".$time.", 1)";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_topics";
$install_db[] = "CREATE TABLE ".$mysql_pref."_topics (
  `id` int(10) NOT NULL auto_increment,
  `forum_id` smallint(5) NOT NULL default '0',
  `title` varchar(255) NOT NULL default '',
  `description` varchar(255) NOT NULL default '',
  `post_id` int(10) NOT NULL default '0',
  `date_open` int(10) NOT NULL default '0',
  `date_last` int(10) NOT NULL default '0',
  `status` varchar(10) NOT NULL,
  `post_num` int(10) NOT NULL default '0',
  `post_hiden` smallint(5) NOT NULL default '0',
  `post_fixed` smallint(5) NOT NULL default '0',
  `views` mediumint(8) NOT NULL default '0',
  `last_post_id` int(10) NOT NULL default '0',
  `last_post_member` mediumint(8) NOT NULL default '0',
  `member_name_open` varchar(40) NOT NULL default '',
  `member_id_open` mediumint(8) NOT NULL default '0',
  `member_name_last` varchar(40) NOT NULL default '',
  `fixed` tinyint(1) NOT NULL default '0',
  `hiden` tinyint(1) NOT NULL default '0',
  `poll_id` int(10) NOT NULL default '0',
  `basket` tinyint(1) NOT NULL default '0',
  `basket_fid` smallint(5) NOT NULL default '0',
  `metatitle` varchar(255) NOT NULL default '',
  `metadescr` varchar(200) NOT NULL default '',
  `metakeys` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `forum_id` (`forum_id`),
  KEY `post_id` (`post_id`),
  KEY `date_open` (`date_open`),
  KEY `date_last` (`date_last`),
  KEY `status` (`status`),
  KEY `post_num` (`post_num`),
  KEY `views` (`views`),
  KEY `last_post_id` (`last_post_id`),
  KEY `last_post_member` (`last_post_member`),
  KEY `member_name_open` (`member_name_last`),
  KEY `member_id_open` (`member_id_open`),
  KEY `fixed` (`fixed`),
  KEY `hiden` (`hiden`),
  KEY `basket` (`basket`),
  KEY `poll_id` (`poll_id`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_topics` (`id`, `forum_id`, `title`, `description`, `post_id`, `date_open`, `date_last`, `status`, `post_num`, `post_hiden`, `post_fixed`, `views`, `last_post_id`, `last_post_member`, `member_name_open`, `member_id_open`, `member_name_last`, `fixed`, `hiden`, `poll_id`, `basket`, `basket_fid`) VALUES
(1, 2, 'Добро пожаловать', '', 1, 1294685988, 1294685988, 'open', 0, 0, 0, 3, 1, 0, 'LogicBoard', 0, 'LogicBoard', 0, 0, 0, 0, 0)";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_posts";
$install_db[] = "CREATE TABLE ".$mysql_pref."_posts (
  `pid` int(10) NOT NULL auto_increment,
  `topic_id` int(10) NOT NULL default '0',
  `new_topic` tinyint(1) NOT NULL default '0',
  `text` text NOT NULL,
  `post_date` int(10) NOT NULL default '0',
  `edit_date` int(10) NOT NULL default '0',
  `post_member_id` int(10) NOT NULL default '0',
  `post_member_name` varchar(40) NOT NULL default '',
  `ip` varchar(16) default NULL,
  `hide` tinyint(1) NOT NULL default '0',
  `fixed` tinyint(1) NOT NULL default '0',
  `attachments` text NOT NULL,
  `edit_member_id` int(10) NOT NULL default '0',
  `edit_member_name` varchar(40) NOT NULL default '',
  `edit_reason` varchar(255) NOT NULL default '',
  `moder_member_id` int(10) NOT NULL default '0',
  `moder_member_name` varchar(40) NOT NULL default '',
  `moder_reason` varchar(255) NOT NULL default '',
  `moder_date` int(10) NOT NULL default '0',
  `utility` smallint(5) NOT NULL default '0',
  PRIMARY KEY  (`pid`),
  KEY `topic_id` (`topic_id`),
  KEY `new_topic` (`new_topic`),
  KEY `post_date` (`post_date`),
  KEY `post_member_id` (`post_member_id`),
  KEY `post_member_name` (`post_member_name`),
  KEY `hide` (`hide`),
  KEY `fixed` (`fixed`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_posts` (`pid`, `topic_id`, `new_topic`, `text`, `post_date`, `edit_date`, `post_member_id`, `post_member_name`, `ip`, `hide`, `fixed`, `attachments`, `edit_member_id`, `edit_member_name`, `edit_reason`, `moder_member_id`, `moder_member_name`, `moder_reason`, `moder_date`) VALUES
(1, 1, 1, 'Поздравляем Вас с успешной установкой форума LogicBoard!<br /><br />Внимательно настройте движок под Ваши требования в центре управления.<br />Если у вас есть вопросы или пожелания, то смело пишите на <a href=''http://logicboard.ru/support/''>форуме поддержки</a>.<br /><br />С уважением,<br />LogicBoard!', 1294685988, 1294686341, 0, 'LogicBoard', '255.255.255.255', 0, 0, '', 0, '', '', 0, '', '', 0)";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_members_online";
$install_db[] = "CREATE TABLE ".$mysql_pref."_members_online (
  `mo_id` varchar(60) NOT NULL,
  `mo_member_id` mediumint(8) NOT NULL default '0',
  `mo_member_name` varchar(40) NOT NULL default '',
  `mo_member_group` smallint(5) NOT NULL,
  `mo_ip` varchar(16) default NULL,
  `mo_date` int(10) NOT NULL default '0',
  `mo_browser` varchar(200) default NULL default '',
  `mo_location` varchar(255) NOT NULL,
  `mo_loc_do` varchar(255) NOT NULL,
  `mo_loc_op` varchar(255) NOT NULL,
  `mo_loc_id` int(10) NOT NULL default '0',
  `mo_hide` tinyint(1) NOT NULL default '0',
  `mo_loc_fid` smallint(5) NOT NULL default '0',
  PRIMARY KEY  (`mo_id`),
  KEY `mo_member_id` (`mo_member_id`),
  KEY `mo_ip` (`mo_ip`),
  KEY `mo_member_name` (`mo_member_name`),
  KEY `mo_member_group` (`mo_member_group`),
  KEY `mo_location` (`mo_location`),
  KEY `mo_loc_do` (`mo_loc_do`),
  KEY `mo_loc_op` (`mo_loc_op`),
  KEY `mo_loc_id` (`mo_loc_id`),
  KEY `mo_hide` (`mo_hide`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_rules";
$install_db[] = "CREATE TABLE ".$mysql_pref."_rules (
  `id` tinyint(3) NOT NULL auto_increment,
  `text` text NOT NULL,
  `lastdate` varchar(20) default NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_forums_moderator";
$install_db[] = "CREATE TABLE ".$mysql_pref."_forums_moderator (
  `fm_id` smallint(5) NOT NULL auto_increment,
  `fm_forum_id` int(11) NOT NULL default '0',
  `fm_member_id` mediumint(8) NOT NULL default '0',
  `fm_member_name` varchar(40) NOT NULL default '',
  `fm_group_id` smallint(5) NOT NULL default '0',
  `fm_is_group` tinyint(1) NOT NULL default '0',
  `fm_permission` text NOT NULL,
  PRIMARY KEY  (`fm_id`),
  KEY `fm_forum_id` (`fm_forum_id`),
  KEY `fm_member_id` (`fm_member_id`),
  KEY `fm_member_name` (`fm_member_name`),
  KEY `fm_group_id` (`fm_group_id`),
  KEY `fm_is_group` (`fm_is_group`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_control_center_admins";
$install_db[] = "CREATE TABLE ".$mysql_pref."_control_center_admins (
  `cca_id` smallint(5) NOT NULL auto_increment,
  `cca_member_id` mediumint(8) NOT NULL default '0',
  `cca_group` smallint(5) NOT NULL default '0',
  `cca_is_group` tinyint(1) NOT NULL default '0',
  `cca_permission` text NOT NULL,
  `cca_update` int(10) NOT NULL default '0',
  PRIMARY KEY  (`cca_id`),
  KEY `cca_member_id` (`cca_member_id`),
  KEY `cca_group` (`cca_group`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_logs_blocking";
$install_db[] = "CREATE TABLE ".$mysql_pref."_logs_blocking (
  `id` mediumint(8) NOT NULL auto_increment,
  `member_id` mediumint(8) NOT NULL default '0',
  `moder_id` mediumint(8) NOT NULL default '0',
  `moder_name` varchar(40) NOT NULL default '',
  `date` int(10) NOT NULL default '0',
  `ip`  varchar(16) default NULL,
  `info` text NOT NULL,
  `auto_unblock` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `member_id` (`member_id`),
  KEY `moder_id` (`moder_id`),
  KEY `moder_name` (`moder_name`),
  KEY `auto_unblock` (`auto_unblock`),
  KEY `date` (`date`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_forums_filter";
$install_db[] = "CREATE TABLE ".$mysql_pref."_forums_filter (
  `id` mediumint(8) NOT NULL auto_increment,
  `word` varchar(255) NOT NULL default '',
  `word_replace` varchar(255) NOT NULL default '',
  `type` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_topics_subscribe";
$install_db[] = "CREATE TABLE ".$mysql_pref."_topics_subscribe (
  `id` int(10) NOT NULL auto_increment,
  `subs_member` mediumint(8) NOT NULL default '0',
  `topic` int(10) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  `send_status` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `subs_member` (`subs_member`),
  KEY `topic` (`topic`),
  KEY `date` (`date`),
  KEY `send_status` (`send_status`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_forums_notice";
$install_db[] = "CREATE TABLE ".$mysql_pref."_forums_notice (
  `id` mediumint(8) NOT NULL auto_increment,
  `author` varchar(40) NOT NULL default '',
  `author_id` mediumint(8) NOT NULL default '0',
  `title` varchar(255) NOT NULL default '',
  `text` text NOT NULL,
  `forum_id` text NOT NULL,
  `start_date` int(10) NOT NULL default '0',
  `end_date` int(10) NOT NULL default '0',
  `group_access` text NOT NULL,
  `active_status` tinyint(1) NOT NULL default '1',
  `show_sub` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `author_id` (`author_id`),
  KEY `start_date` (`start_date`),
  KEY `end_date` (`end_date`),
  KEY `active_status` (`active_status`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_user_agent";
$install_db[] = "CREATE TABLE ".$mysql_pref."_user_agent (
  `id` smallint(5) NOT NULL auto_increment,
  `name` varchar(255) NOT NULL default '',
  `search_ua` varchar(255) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `name` (`name`),
  KEY `search_ua` (`search_ua`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_user_agent` (`id`, `name`, `search_ua`) VALUES
(6, 'Google', 'google'),
(7, 'Google', 'Googlebot'),
(8, 'Яндекс', 'Yandex'),
(9, 'Rambler', 'StackRambler'),
(10, 'Yahoo', 'Yahoo Slurp'),
(11, 'Yahoo', 'Yahoo FeedSeeker'),
(12, 'Alexa', 'ia_archiver'),
(13, 'AltaVista', 'Scooter'),
(14, 'Facebook', 'facebookexternalhit'),
(15, 'MSProxy', 'MSProxy'),
(16, 'MSN/Bing', 'msnbot'),
(17, 'Aport', 'Aport'),
(18, 'Nigma', 'Nigma')";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_members_login";
$install_db[] = "CREATE TABLE ".$mysql_pref."_members_login (
  `login_ip` varchar(16) NOT NULL default '',
  `login_count` smallint(5) NOT NULL default '0',
  `login_date` int(10) NOT NULL default '0',
  PRIMARY KEY  (`login_ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_topics_poll";
$install_db[] = "CREATE TABLE ".$mysql_pref."_topics_poll (
  `id` int(10) NOT NULL auto_increment,
  `tid` int(10) NOT NULL default '0',
  `vote_num` mediumint(8) NOT NULL default '0',
  `title` varchar(255) NOT NULL default '',
  `question` varchar(255) NOT NULL default '',
  `variants` text NOT NULL,
  `multiple` tinyint(1) NOT NULL default '0',
  `open_date` int(10) NOT NULL default '0',
  `answers` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `tid` (`tid`),
  KEY `vote_num` (`vote_num`),
  KEY `open_date` (`open_date`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_topics_poll_logs";
$install_db[] = "CREATE TABLE ".$mysql_pref."_topics_poll_logs (
  `id` int(11) NOT NULL auto_increment,
  `poll_id` int(10) NOT NULL default '0',
  `ip` varchar(16) NOT NULL default '',
  `member_id` mediumint(8) NOT NULL default '0',
  `member_name` varchar(40) NOT NULL default '',
  `log_date` int(10) NOT NULL default '0',
  `answer`varchar(255) NOT NULL default '',
  PRIMARY KEY  (`id`),
  KEY `poll_id` (`poll_id`),
  KEY `member_id` (`member_id`),
  KEY `member_name` (`member_name`),
  KEY `log_date` (`log_date`),
  KEY `answer` (`answer`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_logs_delivery";
$install_db[] = "CREATE TABLE ".$mysql_pref."_logs_delivery (
  `id` mediumint(8) NOT NULL auto_increment,
  `member_id` mediumint(8) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  `date_end` int(10) NOT NULL default '0',
  `ip`  varchar(16) default NULL,
  `mgr` varchar(255) default NULL,
  `metod` tinyint(1) NOT NULL default '0',
  `title` varchar(255) default NULL,
  `text` text NOT NULL,
  `send_interval` mediumint(8) NOT NULL default '0',
  `onetime` mediumint(8) NOT NULL default '0',
  `m_count` mediumint(8) NOT NULL default '0',
  `active_status` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `member_id` (`member_id`),
  KEY `date` (`date`),
  KEY `date_end` (`date_end`),
  KEY `ip` (`ip`),
  KEY `active_status` (`active_status`),
  KEY `title` (`title`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_members_status";
$install_db[] = "CREATE TABLE ".$mysql_pref."_members_status (
  `id` mediumint(8) NOT NULL auto_increment,
  `member_id` mediumint(8) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  `text` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `member_id` (`member_id`),
  KEY `date` (`date`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_adtblock";
$install_db[] = "CREATE TABLE ".$mysql_pref."_adtblock (
  `id` mediumint(8) NOT NULL auto_increment,
  `title` varchar(255) NOT NULL default '',
  `text` text NOT NULL,
  `forum_id` text NOT NULL,
  `in_posts` tinyint(1) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  `group_access` text NOT NULL,
  `active_status` tinyint(1) NOT NULL default '1',
  PRIMARY KEY  (`id`),
  KEY `date` (`date`),
  KEY `active_status` (`active_status`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_members_flood";
$install_db[] = "CREATE TABLE ".$mysql_pref."_members_flood (
  `fl_id` mediumint(8) NOT NULL auto_increment,
  `fl_mid` mediumint(8) NOT NULL default '0',
  `fl_ip` varchar(16) default NULL,
  `fl_last_date` int(10) NOT NULL default '0',
  `fl_note` text NOT NULL,
  `fl_check_type` tinyint(1) NOT NULL default '0',
  `is_blocked` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`fl_id`),
  KEY `fl_mid` (`fl_mid`),
  KEY `fl_ip` (`fl_ip`),
  KEY `fl_last_date` (`fl_last_date`),
  KEY `fl_check_type` (`fl_check_type`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_topics_sharelink";
$install_db[] = "CREATE TABLE ".$mysql_pref."_topics_sharelink (
  `id` mediumint(8) NOT NULL auto_increment,
  `title` varchar(255) NOT NULL default '',
  `icon` varchar(255) NOT NULL default '',
  `link` varchar(255) NOT NULL default '',
  `link_topic` varchar(255) NOT NULL default '',
  `title_topic` varchar(255) NOT NULL default '',
  `active_status` tinyint(1) NOT NULL default '1',
  `dop_parametr` varchar(255) NOT NULL default '',
  `send_url` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_topics_sharelink` (`id`, `title`, `icon`, `link`, `link_topic`, `title_topic`, `active_status`, `dop_parametr`, `send_url`) VALUES
(1, 'Twitter', 'twitter', 'http://twitter.com/', '', 'status', 1, '', 0),
(2, 'Вконтакте', 'vkontakte', 'http://vkontakte.ru/share.php', 'url', 'title', 1, '', 0),
(3, 'Facebook', 'facebook', 'http://www.facebook.com/sharer.php', 'u', '', 1, '', 1),
(4, 'Memori', 'memori', 'http://memori.ru/link/', 'u_data[url]', 'u_data[name]', 1, 'sm=1', 0),
(5, 'Digg', 'digg', 'http://digg.com/submit', 'url', 'title', 1, '', 0),
(6, 'БобрДобр', 'bobrdobr', 'http://bobrdobr.ru/addext.html', 'url', 'title', 1, '', 0)";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_topics_files";
$install_db[] = "CREATE TABLE ".$mysql_pref."_topics_files (
  `file_id` mediumint(8) NOT NULL auto_increment,
  `file_title` varchar(255) NOT NULL default '',
  `file_name` varchar(255) NOT NULL default '',
  `file_name_mini` varchar(255) NOT NULL default '',
  `file_type` varchar(255) NOT NULL default '',
  `file_mname` varchar(255) NOT NULL default '',
  `file_mid` varchar(255) NOT NULL default '',
  `file_date` int(10) NOT NULL default '0',
  `file_size` int(11) NOT NULL default '0',
  `file_count` int(11) NOT NULL default '0',
  `file_fid` smallint(5) NOT NULL default '0',
  `file_tid` int(10) NOT NULL default '0',
  `file_pid` int(10) NOT NULL default '0',
  `file_convert` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`file_id`),
  KEY `file_mid` (`file_mid`),
  KEY `file_fid` (`file_fid`),
  KEY `file_tid` (`file_tid`),
  KEY `file_pid` (`file_pid`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_history_update";
$install_db[] = "CREATE TABLE ".$mysql_pref."_history_update (
  `id` mediumint(8) NOT NULL auto_increment,
  `vid` varchar(20) NOT NULL default '',
  `date` int(10) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `vid` (`vid`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "INSERT INTO `".$mysql_pref."_history_update` (`vid`, `date`) VALUES ('2.2', '".$time."')";

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_members_warning";
$install_db[] = "CREATE TABLE ".$mysql_pref."_members_warning (
  `id` mediumint(8) NOT NULL auto_increment,
  `mid` mediumint(8) NOT NULL default '0',
  `moder_id` mediumint(8) NOT NULL default '0',
  `moder_name` varchar(40) NOT NULL default '',
  `date` int(10) NOT NULL default '0',
  `description` text NOT NULL,
  `st_w` tinyint(1) NOT NULL default '1',
  PRIMARY KEY  (`id`),
  KEY `mid` (`mid`),
  KEY `st_w` (`st_w`),
  KEY `moder_id` (`moder_id`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_cache_update";
$install_db[] = "CREATE TABLE ".$mysql_pref."_cache_update (
  `name` varchar(40) NOT NULL default '',
  `lastdate` int(10) NOT NULL default '0',
  PRIMARY KEY  (`name`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_posts_utility";
$install_db[] = "CREATE TABLE ".$mysql_pref."_posts_utility (
  `id` smallint(5) NOT NULL auto_increment,
  `pid` int(10) NOT NULL default '0',
  `mid` mediumint(8) NOT NULL default '0',
  `ip` varchar(16) default NULL,
  PRIMARY KEY  (`id`),
  KEY `pid` (`pid`),
  KEY `mid` (`mid`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_complaint";
$install_db[] = "CREATE TABLE ".$mysql_pref."_complaint (
  `id` int(10) NOT NULL auto_increment,
  `module` varchar(40) default NULL,
  `cid` int(10) NOT NULL default '0',
  `mid` mediumint(8) NOT NULL default '0',
  `ip` varchar(16) default NULL,
  `date` int(10) NOT NULL default '0',
  `info` text NOT NULL,
  PRIMARY KEY  (`id`),
  KEY `module` (`module`),
  KEY `cid` (`cid`),
  KEY `mid` (`mid`),
  KEY `date` (`date`),
  KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "DROP TABLE IF EXISTS ".$mysql_pref."_discuss";
$install_db[] = "CREATE TABLE ".$mysql_pref."_discuss (
  `id` int(11) NOT NULL auto_increment,
  `nid` int(10) NOT NULL default '0',
  `tid` int(10) NOT NULL default '0',
  `date` int(10) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `nid` (`nid`),
  KEY `tid` (`tid`)
) ENGINE=MyISAM DEFAULT CHARSET=".$coding_forum;

$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_favorite` text NOT NULL;";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_subscribe` text NOT NULL;";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `mf_options` text NOT NULL;";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `view_topic` text NOT NULL;";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `count_warning` tinyint(3) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `mstatus` mediumint(8) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `personal_title` varchar(50) NOT NULL default '';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `topics_num` smallint(5) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `posts_num` mediumint(7) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `secret_key` varchar(32) NOT NULL default '';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_twitter` varchar(200) NOT NULL default '';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_vkontakte` varchar(200) NOT NULL default '';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_skype` varchar(200) NOT NULL default '';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_sex` tinyint(2) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_limit_publ` tinyint(1) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_limit_days` smallint(4) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_limit_date` int(10) NOT NULL default '0';";
$install_db[] = "CREATE INDEX mstatus ON `".$mysql_pref_userdle."_users` (mstatus);";

$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_b_day` tinyint(2) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_b_month` tinyint(2) NOT NULL default '0';";
$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `lb_b_year` smallint(4) NOT NULL default '0';";

$install_db[] = "ALTER TABLE `".$mysql_pref_userdle."_users` ADD `ulogin_key` varchar(255) NOT NULL default '' AFTER `name`;";

$install_db[] = "CREATE INDEX lb_b_day ON `".$mysql_pref_userdle."_users` (lb_b_day);";
$install_db[] = "CREATE INDEX lb_b_month ON `".$mysql_pref_userdle."_users` (lb_b_month);";
$install_db[] = "CREATE INDEX lb_b_year ON `".$mysql_pref_userdle."_users` (lb_b_year);";

define ( 'LogicBoard', true );

require_once LB_CLASS . '/database.php';
include_once LB_CONFIG . '/board_db.php';

$i = 0;
foreach($install_db as $table)
{
    $i ++;
    if ($i > 50)
    {
        sleep(3);
        $i = 0;
    }
    $DB->not_filtred($table);
}

$DB->free();

$data_bd = $DB->not_filtred("SELECT id, group_name FROM ".$mysql_pref_userdle."_usergroups ORDER BY id ASC");
while ( $row = $DB->get_row($data_bd) )
{
    $row['group_name'] = $DB->addslashes($row['group_name']);
    if ($row['id'] == 1)
        $DB->not_filtred("INSERT INTO ".$mysql_pref."_groups SET g_id = '{$row['id']}', g_title = '{$row['group_name']}', g_prefix_st = '<font color=\"#ff9c00\">', g_prefix_end = '</font>', g_icon = '', g_access = 'a:7:{s:14:\"local_deltopic\";i:1;s:16:\"local_titletopic\";i:1;s:15:\"local_polltopic\";i:1;s:15:\"local_opentopic\";i:1;s:16:\"local_closetopic\";i:1;s:13:\"local_delpost\";i:1;s:16:\"local_changepost\";i:1;}', g_supermoders = '1', g_access_cc = '1', g_show_online = '1', g_new_topic = '1', g_reply_topic = '1', g_reply_close = '1', g_warning = '1', g_show_hiden = '1', g_show_close_f = '1', g_hide_text = '1', g_signature = '1', g_search = '1', g_status = '150', g_link_forum = '1'");
    elseif ($row['id'] == 5)
        $DB->not_filtred("INSERT INTO ".$mysql_pref."_groups SET g_id = '{$row['id']}', g_title = '{$row['group_name']}', g_prefix_st = '', g_prefix_end = '', g_icon = '', g_access = 'a:7:{s:14:\"local_deltopic\";i:0;s:16:\"local_titletopic\";i:0;s:15:\"local_polltopic\";i:0;s:15:\"local_opentopic\";i:0;s:16:\"local_closetopic\";i:0;s:13:\"local_delpost\";i:0;s:16:\"local_changepost\";i:0;}', g_supermoders = '0', g_access_cc = '0', g_show_online = '1', g_new_topic = '1', g_reply_topic = '0', g_reply_close = '0', g_warning = '0', g_show_hiden = '0', g_show_close_f = '0', g_hide_text = '0', g_signature = '0', g_search = '1', g_status = '0', g_link_forum = '1'");
    else
        $DB->not_filtred("INSERT INTO ".$mysql_pref."_groups SET g_id = '{$row['id']}', g_title = '{$row['group_name']}', g_prefix_st = '', g_prefix_end = '', g_icon = '', g_access = 'a:7:{s:14:\"local_deltopic\";i:0;s:16:\"local_titletopic\";i:0;s:15:\"local_polltopic\";i:0;s:15:\"local_opentopic\";i:0;s:16:\"local_closetopic\";i:0;s:13:\"local_delpost\";i:0;s:16:\"local_changepost\";i:0;}', g_supermoders = '0', g_access_cc = '0', g_show_online = '1', g_new_topic = '1', g_reply_topic = '1', g_reply_close = '0', g_warning = '0', g_show_hiden = '0', g_show_close_f = '0', g_hide_text = '0', g_signature = '1', g_search = '1', g_status = '150', g_link_forum = '1'");
}
$DB->free($data_bd);

?>